src/share_it/recent_reading5.zh.org
#+STARTUP: showall
#+options: toc:nil

#+TITLE: 分享最近阅读的书籍清单(五)
#+AUTHOR: JaneGwaww

* 分享最近阅读的书籍清单(五)

#+toc: headlines local

这些都是在人生中的好书藉或好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。

** How to Take Smart Notes[fn:1]

#+BEGIN_CENTER
卡片笔记写作法[fn:2]
#+END_CENTER

#+begin_quote
没有人能在不作记录下思考。

--Luhmann
#+end_quote

*我的结论*

好书

** The Craft of Text Editing[fn:3]

#+begin_center
文本编辑的技巧
#+end_center

#+begin_quote
没有人能在不作记录下思考。

--Luhmann
#+end_quote

*我的结论*

好书

** Beautiful Racket[fn:4]
/an introduction to language-oriented programming using Racket/

#+begin_center
优雅的Racket
#+end_center

#+begin_quote
没有人能在不作记录下思考。

--Luhmann
#+end_quote

*我的结论*

好书

** Technical Blogging, Second Edition[fn:6]
/Amplify Your Influence/

#+begin_center
技术博客
#+end_center

#+begin_quote
没有人能在不作记录下思考。

--Luhmann
#+end_quote

*我的结论*

好书

** Crafting Interpreters[fn:5]

#+begin_center
制作
#+end_center

#+begin_quote
没有人能在不作记录下思考。

--Luhmann
#+end_quote

*我的结论*

好书

* 写在后面
# #+include: "../footer.zh.org"

* Footnotes
[fn:6] [[https://medium.com/pragmatic-programmers/table-of-contents-10982edb748f]]

[fn:1] [[https://www.amazon.com/How-Take-Smart-Notes-Nonfiction/dp/1542866502]]

[fn:2] [[https://book.douban.com/subject/35503571/]]

[fn:3] [[http://www.finseth.com/craft/]]

[fn:4] [[https://beautifulracket.com/]]

[fn:5] [[https://craftinginterpreters.com/]]
