src/share_it/recent_reading5.zh.md


# 分享最近阅读的书籍清单(五)

1.  [How to Take Smart Notes](#org5af16f0)
2.  [The Craft of Text Editing](#orgc109ba6)
3.  [Beautiful Racket](#orgcabfa43)
4.  [Technical Blogging, Second Edition](#org21bc739)
5.  [Crafting Interpreters](#org9fea046)

这些都是在人生中的好书藉或好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。


<a id="org5af16f0"></a>

## How to Take Smart Notes<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>

<div class="org-center">
<p>
卡片笔记写作法<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>
</p>
</div>

> 没有人能在不作记录下思考。
> 
> &#x2013;Luhmann

**我的结论**

好书


<a id="orgc109ba6"></a>

## The Craft of Text Editing<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>

<div class="org-center">
<p>
文本编辑的技巧
</p>
</div>

> 没有人能在不作记录下思考。
> 
> &#x2013;Luhmann

**我的结论**

好书


<a id="orgcabfa43"></a>

## Beautiful Racket<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>

*an introduction to language-oriented programming using Racket*

<div class="org-center">
<p>
优雅的Racket
</p>
</div>

> 没有人能在不作记录下思考。
> 
> &#x2013;Luhmann

**我的结论**

好书


<a id="org21bc739"></a>

## Technical Blogging, Second Edition<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>

*Amplify Your Influence*

<div class="org-center">
<p>
技术博客
</p>
</div>

> 没有人能在不作记录下思考。
> 
> &#x2013;Luhmann

**我的结论**

好书


<a id="org9fea046"></a>

## Crafting Interpreters<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>

<div class="org-center">
<p>
制作
</p>
</div>

> 没有人能在不作记录下思考。
> 
> &#x2013;Luhmann

**我的结论**

好书


# 写在后面


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://www.amazon.com/How-Take-Smart-Notes-Nonfiction/dp/1542866502>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://book.douban.com/subject/35503571/>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <http://www.finseth.com/craft/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://beautifulracket.com/>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://medium.com/pragmatic-programmers/table-of-contents-10982edb748f>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://craftinginterpreters.com/>
